Repository: mozilla-l10n/mt-training-data
Catalog: hno/hno_pontoon.tmx
Source language: en_us
Languages: hno

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
hno: موذیلا کامن وائس کو ہک متنوع کمیونیٹی جس بچ کارکنان، ماہرین لسانیات، ڈیٹا سائنسداناں، ماہرین تعلیم تے سافٹ ویئر انجینئر شامل ہن ممکن بنایا ہے۔ ایہ پروجیکٹ موزیلا فاؤنڈیشن دے زیر انتظام ہے۔

source: Mozilla Common Voice is the world’s most diverse crowdsourced open speech dataset - and we’re powered entirely by donations. It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. If you value open, inclusive data - <b>donate today!</b>
hno: موزیلا کامن وائس دُنیا دا سب تو متنوع کراوڈ سورس اوپن سپیچ ڈیٹا سیٹ ہے- تے اسیں پوری طرح عطیات اتے چلدے ہاں۔ڈیٹا سیٹس دی میزبانی کرنا اَستے ہور اس پلیٹ فارم کو 100 تو زیادہ زبان دی کمیونیٹیاں جڑیاں استے اُتا بھروسہ کردیاں ہن واسطے اچھا بنڑانڑا واسطے تقریباََ ہک ملین ڈالر سالانہ خرچ آندا ہے۔ اگر تُسین اوپن، جامع ڈیٹا دی قدر کردے ہو تے- <b>اَج ہی عطیہ کرو!</b>

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
hno: موزیلا دے اوپن سورس وائس ریکگنیشن انجن ڈیپ سپیچ کو سپیچ ریکگنیشن ایپلی کیشنز بنڑا واسطے استعمال کر ہکدے ہاں۔ اسدا <githubLink>Github جائزہ </githubLink> پڑھو یا شروع کرنا دا طریقہ سیکھنڑا کیتے <discourseLink>DeepSpeech ڈسکورس </discourseLink> بچ شامل ہوو۔

source: Mutual accountability.
hno: باہمی احتساب

source: n
hno: ناں

source: N
hno: ناں

source: N/A
hno: این/اے

source: Name
hno: ناں

source: Names of your language
hno: تسدی زبان دے ناں

source: Native Language
hno: مقامی زبان

source: Nature and Environment
hno: فطرت تے ماحول

source: Need help deciding which to choose?
hno: اے فیصلہ کرنا آسطے کہ کے چُڑنا اے، مدد چائی دی اے؟

source: Need help with the Sex or Gender changes?
hno: جنس یا صنف دے حوالے نال مدد دی لوڑ ہے؟

source: Need some help with accent?
hno: لہجے بارے کجھ مدد چاہی دی ہے؟

source: Need some help with variants?
hno: لہجیاں بارے کجھ مدد چاہی دی ہے؟

source: Need to download your data?
hno: اپنڑا ڈیٹا ڈاؤنلوڈ کرنا دی ضرروت ہے؟

source: Nepali
hno: نیپالی

source: New Language Launch
hno: نوی زبان دی شروعات

source: News and Current Affairs
hno: خبراں تے موجودا حالات

source: Next
hno: اگلا

source: Ngiembon
hno: نیگمبون

source: Nias
hno: نیاس

source: Nigerian Pidgin English
hno: نائیجیرین پیجن انگلش

source: NKo
hno: نکو

source: No
hno: ناں

source: [No ‘a’ in the original text]
hno: [اصل عبارت بچ کوئی ‘a’ نیں]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
hno: <noCopyright>کوئی کاپی رائٹ </noCopyright> پابندیاں نیں (cc-0)

source: No foreign letters
hno: کوئی باہر دے لفظ ناں ہون

source: No gravatar found for your email
hno: تسدی ای میل آستے کوئی Gravatar نیں ملیا

source: No information
hno: کوئی معلومات نیں

source: No information available
hno: کوئی معلومات دستیاب نیں۔

source: No microphone found.
hno: مائیکروفون نیں مِلیا۔

source: Non-binary
hno: نان-بائنری

source: No numbers and special characters
hno: کوئی عدد یا خاص حروف ناں ہوے

source: Northern Hindko
hno: شمالی ہندکو

source: Northern Sotho
hno: شمالی سوٹھو

source: Northwest Gbaya
hno: شمالی مغربی گبیا

source: Norwegian Bokmål
hno: نارویجی بوکمال

source: Norwegian Nynorsk
hno: نارویجی نورسک

source: No sentences to review. <addLink>Add more sentences now!</addLink>
hno: جائزے واسطے کوئی جملے نیں۔<addLink>ہونڑ ہور جملے شامل کرو!</addLink>

source: ⓘ Not all sentences and clips have Variant tags yet!
hno: ⓘ اجاں سارے جملیاں تے کلپاں دے لہجے دے ٹیگ نیں!

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
hno: نوٹ: جڑے ویلے 'نظرایند' تے سیٹ ہوا، ایہ ترتیباں <profileLink>پروفائل ورقے</profileLink> تو بدل ہکدیاں ہن۔

source: Note: You will still need to select between Speak or Listen to change contribution type.
hno: نوٹ: تُساں کو حصے دی قسم بٹینڑا آسطے بولو یا سنڑو بِچو ہک شے چُڑنی پیسی۔

source: Not Found
hno: نیں ملیا

source: No Thanks
hno: نہ، مہربانی

source: No thanks, continue speaking
hno: ناں شکریہ، بُولدے رو

source: No variant selected
hno: کوئی ورائٹی نیں چُنڑی

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
hno: ہونڑ جدو تسیں کامن وائس دے بارے تھوڑا جیا زیادہ جانڑدے ہو، کیاں ناں اس کو آزما گِِناں؟ جملیاں کو اُچی آواز بچ پڑھنا شروع کرنا واسطےمائیکروفون آئیکون تے کلک کرو۔<br/><br/>اگر تسیں دوئیاں لوگاں دی آواز آلے تعاون دا جائزہ گھننا چہندے ہو تے پلے آئیکن تے کلک کرو۔ تسیں اے تصدیق کرنا بچ مدد کرسو کہ ریکاڈنگاں سکرین تے لکھیاں جملیاں نال ملدیاں ہن۔

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
hno: ہونڑ تسیں اوپن-سورس آواز دا ڈیٹابیس بڑانڑا بچ اسدی مدد آستے آپنڑی آواز عطیہ کر سکدے ہو، جس کو کوئی بھی ویب تے ڈیوائساں واسطے نویاں ایپاں بڑینڑا کیتے استعمال کر سکدا ہوے۔ ہک جملہ پڑھو تاکہ مشیناں اے سکھ سکن کہ اصلی لوک کسطرح بولدے ہن۔ میعار چنگا کرنا آستے دویاں لوگاں دے کم دا جائزہ گھنو۔ اے اتنا آسان ہے!

source: Nubi
hno: نیوبی

source: Number of Voices
hno: آوازاں دی تعداد

source: Numbers
hno: گنتی

source: Occitan
hno: آكسيٹان

source: Odia
hno: اوڑیہ

source: Off
hno: بند

source: Offensive Content
hno: جارحانہ مواد

source: Offensive language
hno: ناشائستہ زبان

source: Offensive speech
hno: غیر مہذب تقریر

source: Offline Sources
hno: آف لائن ذرائع

source: On
hno: کھلا

source: On desktop devices you can contribute by downloading…
hno: ڈیسک ٹاپ کمپیوٹر تے تسیں ڈاؤن لوڈ نال حصہ ڈال ہکدے ہو۔

source: On his head he wore a beret.
hno: اس سنڑ اپنڑے سرا تے ہک بیریٹ لایا دا آسیا۔

source: On iOS please continue with Safari to enable recording…
hno: آئی او ایس تے ریکاڈنگ فعال رکھنڑا واسطے سفاری نال جاری رکھو، برائے مہربانی۔۔۔

source: Only show me sentences and clips from my variant
hno: مک صرف مڑے لہجے دے جملے تے کلپ دسو

source: On the other hand, if you think that the reader has never come across the word before, and is making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
hno: دوئی طرف، اگر تساں کو لگدا ہے کہ پڑھنا والے دا اس لفظ نال پہلے کدے سامنڑا نیں ہویا، ہور او تلفظ تے غلط اندازہ لا رہیا ہے، براہ کرم (اس کو) رد کر دیو۔ اگر تساں کو یقین نیں، تے سکپ دا بٹن استعمال کرو۔

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
hno: دوئی طرف، اگر تساں کو لگدا ہے کہ پڑھنا والے دا اس لفظ نال کدے پہلے کدے سامنڑا نیں ہویا، ہور او صرف تلفظ تے غلط اندازہ لا رہیا ہے، براہ کرم (اس کو) رد کر دیو۔ اگر تساں کو یقین نیں، تے سکپ دا بٹن استعمال کرو۔

source: Open innovation is at the heart of what we do. For research collaborations, data collection or interviews, <emailFragment>reach out.</emailFragment>
hno: اسیں جو کجھ کردے ہاں اس دل بچ کھلی جدت ہے۔ تحقیقی تعاون، ڈیٹا کٹھا کرنا یا انٹرویو آستے <emailFragment> رابطہ کرو۔ </emailFragment>

source: Optionally join on our email list for updates and new information about the project.
hno: اپڈیٹاں تے پروجیکٹ بارے نئی معلومات واسطے اختیاری طور تے اسدی ای میل دا حصہ بنڑو۔

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
hno: اختیاری طور تے جمع کیتا ڈیموگرافک ڈیٹا(مثال دے طور تے عمر، جنس، زبان تے لہجہ) کدے بھی عوامی نہ کیتا جُلسی، ہور ڈیٹا سیٹ بچ تُسدے اکاؤنٹ نال نہ جوڑیا جُلسی۔ صیح تجزیے دے مقصد آستے گلّیاں آڈیو کلپس نال آبادیاتی ڈیٹا جوڑیا جُلسی- مثال دے طور تے، ہو سکدا ہے تحقیق کرنڑ آلہ ہک ٹرینگ ماڈل کو خاص آبادیاتی حصے آستے نشانڑا بڑینڑا چہندا ہوا۔

source: Ormuri
hno: اُرمُڑی

source: Ossetian
hno: اوسیٹیائی

source: Other
hno: دویا

source: Other Language
hno: ہور زبان

source: Other people validate those voice clips.
hno: دوئے لوگ انھاں آواز دے کلپس دی توثیق کردے ہن۔

source: Other voice datasets…
hno: دوسرے آواز دے ڈیٹا سیٹ۔۔۔

source: Other Voice Datasets
hno: دوسرے آواز دے ڈیٹا سیٹ

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
hno: اسدا کمیونٹی منیجر مزید مدد دی پیشکش کرنا آسطے تساں نال رابطہ کرسی، ہور تساں کو دسّی کہ اگر ہور کوئی کمیونٹی پہلے ہی تسدی زبان تے کم کر ری اے

source: Our governance is founded on the pillars of:
hno: اسدی حکمرانی دی بنیاد اِناں پِلراں تے ہے:

source: Our language is our story, our community, our culture. Let's create the datasets that we want to see in the world.
hno: اسدی زبان اسدی کہانڑی، اسدی قوم، اسدا رہن سہن اے۔ آو ہک ڈیٹا سیٹ بنڑاواں جِڑّا اسیں دنیا بچ دکھنڑا چہندے اں۔

source: Our Partners
hno: اسدے حصے دار

source: Our partners include...
hno: اسدے شراکت داراں بچ شامل ہن۔۔۔

source: Overall Accuracy
hno: مجموعی درستگی

source: Overall Hr. Total
hno: ایچ آر ٹوٹل مجموعی طور تے

source: p
hno: چلاؤ

source: Paiwan
hno: پاٸوان

source: Palula
hno: پالولا

source: Papantla Totonac
hno: پپنٹلا ٹوٹونیک

source: Papiamento
hno: پپیامینٹو

source: Papiamento (Aruba)
hno: پاپیامنتو(آروبا)

source: Participate in language community discussions, ask questions, and learn about upcoming events and talks.
hno: زبان دی برادری بچ گل بات بچ حصہ گِنّو، سوال پُچھو، تے آنڑ آلے پروگراما تے گل بات بارے معلومات حاصل کرو۔

source: Partner
hno: حصے دار

source: Partners
hno: ساتھی

source: Partnerships
hno: حصہ داریاں

source: Partnerships and networks
hno: حصہ داریاں تے نیٹ ورکس

source: Partnerships, Press and Stories, Community and Languages
hno: شراکت داریاں، پریس ہور کہانڑیاں، کمیونٹی ہور زباناں

source: Partner with us
hno: اساں نال حصہ داری کرو

source: [Part of the text can’t be heard]
hno: [ٹیکسٹ دا حصہ سنڑائی ’نیں دیندا]

source: Pashto
hno: پشتو

source: Past recordings download requests
hno: پرانڑیاں ریکاڈنگاں ڈاؤنلوڈ دی درخواستاں

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
hno: <p> کامن وائس ہک ساریاں کو دستیاب وائس ڈیٹا سیٹ ہے، جیڑھاساری دنیا دے رضاکاراں دیاں آوازاں نال طاقتور ہے۔ جیڑھے لوگ آواز دے بارے ایپلی کشنز بڑینڑاں چہندے ہن او مشین لرننگ ماڈلز دی تربیت واسطے ڈیٹا سیٹ دا استعمال کر سکدے ہن۔ </p> <p> اس وقت، زیادہ تر آواز دے ڈیٹا سیٹس کمپنیاں دی ملکیت ہن، جیڑھے جدت کوں روکدے ہن۔اور آواز دے ڈیٹا سیٹس گھٹ نمائندگی کردے ہن: انگریزی ٻولناں والیاں دی، رنگ برنگیاں لوگاں دی، معذور لوگاں دی، کڑیاں تے LGBTQIA+ لوگاں دی۔ اس دا مطلب ہے جڑی آواز-نال-چلنا والی ٹیکنالوجی ہے او بہت ساریاں زباناں واسطے بالکل کم نیں’ کردی، اور جتھاں اے کم کردی ہے، اتھا ہو سکدا ہے اے سبھاں واسطےبرابر اور چنڳی کارکردگی نہ دسے۔ اسیں ہر جگہ لوگاں کو اپنڑی آواز پچنڑیں واسطے متحرک کر کے اسکو تبدیل کرنا چہندے ہاں۔ </p>

source: People come and contribute their voices.
hno: لوگ ایندے ہور اپنڑیاں آوازاں دا تعاون کردے ہن۔

source: Persian
hno: فارسی

source: Personal dashboards keep you up-to-date with individual and community progress.
hno: ذاتی ڈیش بورڈ تساں کس انفرادی تے اجتماعی پیشرفت بارے آگاہی دیندے رہسن۔

source: Personally Identifiable Information
hno: ذاتی طور تے شناخت دے قابل معلومات

source: Platform language
hno: پلیٹ فارم دی زبان

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
hno: کامن وائس دے پورے سفر تے، لوکلائزیشن تو گِِھن کے ڈیٹاسیٹ دے استعمال تک، نال اسدی کمیونٹی نال جُڑنا دے طریقے تے <playbookLink> مددگار رہنمائی گِِھنو </playbookLink>۔

source: <playIcon></playIcon>Last one!
hno: <playIcon></playIcon>اہک آخری!

source: Play/Stop
hno: چلاؤ/رکو

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
hno: مہربانی نال اسدی<templateFileLink>ٹیمپلیٹ فائل</templateFileLink> چیک کرو۔ تُسدے جملے کاپی رائٹ کولو آزاد ہونڑے چاہی دے ہن(CC0 یا اجازت گدیا دا اصل کم جمع کرالنا والے دی طرفو) ہور واضح، دُرست گرائمر والا ہور پڑھنا بچ آسان۔ جمع کیتے دیاں جملیاں کو پڑھنا واسطے تقریباََ 10-15لگنڑے چائیدے ہن، ہور گریز کرنا چاہیدا ہے نمبراں، پراپر ناں تے خصوصی حرفاں بچ۔

source: Please fill out this field.
hno: براہ مہربانی اس خانے کوں پُر کرو۔

source: Please select a language to review sentences.
hno: برائے مہربانی جملیاں دے جائزے واسطے زبان چُنڑو۔

source: Polish
hno: پولش

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
hno: <pontoonAccountLink>اپنڑا اکاؤنٹ بڑاؤ</pontoonAccountLink>اگر تسدا کوئی نیں۔ فر، اپنڑی زبان چنڑو<strong>(‘ٹیم’)</strong> ہور فر،<pontoonCvLink>کامن وائس</pontoonCvLink> پروجیکٹ دا انتخاب کرو۔ اُتھا ترجمہ کرنا والیاں فائلز ہوسن۔ ہکا تے کلک کرو، فر او انگریزی بچ الفاظ ہور ہک بکس ترجمہ کرنا واسطے دسّی۔

source: Portuguese
hno: پرتگالی

source: Powered by global communities, for global communities — 130 languages and growing!
hno: عالمی برادری دی طرفو، عالمی برادری دی —130 زباناں آسطے تے اضافہ ہو رے اے!

source: Press and stories
hno: خبراں ہور کہانڑیاں

source: Press and Stories
hno: پریس ہور کہانڑیاں

source: Press play, listen & tell us: did they accurately speak the sentence below?
hno: پلے دباؤ، سنڑو ہور اساں کو دسو: اُناں سنڑ اے جملا صحیح طرح پڑھیا؟

source: Press { shortcut-play-toggle } to toggle play mode
hno: پلے موڈ کو ٹوگل کرنا آستے { shortcut-play-toggle } دباؤ

source: Privacy
hno: رازداری

source: <privacyLink>Privacy</privacyLink>
hno: <privacyLink>رازداری</privacyLink>

source: Privacy Policy
hno: رازداری دی پالیسی

source: Privacy, security and transparency.
hno: رازداری، حفاظت تے شفافیت۔

source: Pro
hno: پرو

source: Profile
hno: پروفائل

source: Profile information improves the audio data used in training speech recognition accuracy.
hno: پروفائل معلومات آڈیو ڈیٹا کو ہچھا کردی ہے جڑا سپیچ ریکگنیشن ایکوریسی دی تربیت بچ استعمال ہوندا۔

source: Progress
hno: پیش رفت

source: Public Domain
hno: عوامی ڈومین

source: Publicly accessible open speech datasets in 130+ languages
hno: 130 تو زیادہ زباناں بچ عوامی طور تے دستیاب اوپن سپیچ ڈیٹا سیٹ

source: Pular Guinea
hno: پُولر گِِنی

source: Punctuation
hno: علامتاں

source: Punjabi
hno: پنجابی

source: Puno Quechua
hno: پونو کیچوا

source: Quechua Ambo-Pasco
hno: کیوچوا ایمبو پاسکو

source: Quechua Arequipa-La Unión
hno: کیوچوا اریکویپا لا یونیان

source: Quechua Cajatambo
hno: کیوچوا کیجاتمبو

source: Quechua Chanka
hno: قیوچوا چانکا

source: Quechua Chiquián
hno: کیوچوا چیکوی آن

source: Quechua Corongo Ancash
hno: کیوچوا کورونگو انکیش

source: Quechua Jauja Wanka
hno: کیوچوا جاوجا ونکا

source: Quechua Pasco Santa Ana de Tusi
hno: کیوچوا پاسکو سینٹا انا دی توسی

source: Quechua Sihuas Ancash
hno: کیوچوا سیہواس انکیش

source: Quechua Yauyos
hno: کیوچوا یاویوس

source: Question
hno: سوال

source: r
hno: ریکارڈ

source: [‘Raised’ in English is always pronounced as one syllable, not two]
hno: [‘ریزڈ’ انگریزی بچ ہمیشاں ہک سلیبل نال ادا ہوندا ہے، نہ کہ دو]

source: Rate limit exceeded. Try again in { $retryLimit } minutes
hno: شرح دی حد تو زیادہ ہو گیا۔ { $retryLimit } مِنٹوں تو بعد کوشش کرو

source: Rate limit exceeded. Try again in { $retryLimit } seconds
hno: شرح دی حد تو زیادہ ہو گیا۔ { $retryLimit } سیکنڈاں تو بعد کوشش کرو

source: Reach out to governments, non-profits or media organizations to see whether any of their web content, reports or other content can be dedicated to the public domain
hno: حکومتاں، غیر منافع بخش ادارے یا میڈیا اداریاں تو اے پتہ لانڑا کِیتے رابطہ کرو اگر اُن دا کوئی بھی ویب مواد، رپورٹاں یا ہور کوئی مواد عوامی ڈومین واسطے وقف کر سکدے ہن۔

source: Reader Effects
hno: پڑھنا والے دے اثرات

source: Reading all the words on the page correctly does matter. When listening, check very carefully that what has been recorded is exactly what has been written; reject if they have added, contracted or missed words.
hno: صفحے اُتا موجود ساریاں لفظاں کو صحیح طریقے نال پڑھنا نال فرق پیندا ہے۔ سنڑنا وقت، بڑے دھیان نال دِکھیو کہ جَڑا کُجھ ریکاڈ کیتا گیا اُو اُوہی ہووے جڑا لکھیا گیا ہے۔ مسترد کر چُھڑو اگر اُناں سنڑ الفاظ ہور بھائے دے ہوّن، چُھٹّے کیتے دے یا چُھوڑے دے ہوّن۔

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
hno: کنٹریکشنز کو پڑھنا جیڑھے حقیقت بچ موجود نیں، جسطرح "اسیں ہاں" دی بجائے "اسیں آسیاں"، یا اِسدے اُلٹا۔

source: Read More
hno: ہور پڑھو

source: Read more on our About page
hno: اسدے تعارفی صفحے دے بارے مزید پڑھو

source: Read sentences
hno: جملے پڑھو

source: Read Sentences
hno: جملے پڑھو

source: Read sentences aloud in your language and contribute to the most diverse public participation speech dataset in the world.
hno: جملے اپنڑی زبان بچ اُچّی آواز نال پڑھو تے دنیا دے مُچ قسماں آلے عوامی شرکت دے آواز دے ڈیٹا سیٹ وچ حصہ بھاؤ۔

source: Read Sentences, Answer Questions
hno: جملے پڑھو، سوالاں دا جواب دو

source: Read Sentences <small>(Coming soon)</small>
hno: جملے پڑھو<small>(جلدی آرہے ہن)</small>

source: Read sentences submitted by the community in various languages
hno: کمیونٹی دے طرفو مختلف زباناں بچ جمع کرالے دے جملیاں کو پڑھو

source: Read the sentence carefully - don’t miss, change or add words.
hno: جملے احتیاط نال پڑھو- کوئی لفظ رہوا’ نہ، الفاظ نہ’ بدلاؤ یا بداؤ۔

source: Ready to add your voice or lend your ear?
hno: آپنڑی آواز شامل کرنا یا آپنڑا کن ادھار دینڑا واسطے تیار ہو؟

source: Ready to contribute?
hno: حصہ بینڑا آستے تیار ہو؟

source: Ready to do { $count } more?
hno: ہور{ $count }کرنا واسطے تیارہو؟

source: Ready to donate your voice?
hno: اپنڑی آواز عطیہ کرنا کو تیار ہو؟

source: Ready to help validate sentences?
hno: جملیاں دی توثیق واسطے مدد کرنا کو تیار ہو؟

source: reCAPTCHA is required if you want to proceed
hno: اگر تسیں اگاں جُلنا چہندے او تے reCAPTCHA ضروری ہے۔

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
hno: کامن وائس بارے ای میلاں وصول کرو جِڑیاں مقاصد دی یادھانی،پیشرفت بارے آگاہی ہور خبرنامے وغیرہ ہوّن۔

source: Recorded Clips
hno: ریکاڈ ہوئے دے کلپس

source: Recorded Hours
hno: ریکاڈ کیتے دے گھنٹے

source: <recordIcon></recordIcon> Last one!
hno: <recordIcon></recordIcon>آخری ہک!

source: [Recording cut off before the end of the last word]
hno: [آخری لفظ ختم ہونڑا کولو پہلے ریکاڈنگ کٹ گئی ہے]

source: Recordings
hno: ریکاڈنگاں

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
hno: وائس کلپ ریکاڈ کرنا اسدے اوپن ڈیٹا سیٹ دی تعمیر دا ہک لازمی حصہ ہے; کوئی آکھسن کہ اے شغل بھی ہے۔

source: Record/Stop
hno: ریکارڈ/رُکو

source: Record your response
hno: اپنڑا جواب ریکارڈ کرو

source: Record yourself reading sentences in your language
hno: خود ہی اپنڑی زبان بچ پڑھن آلے جملے ریکارڈ کرو

source: Record yourself responding to questions and prompts in your language
hno: خود ہی اپنڑی زبان بچ سوالاں تے اشارے دا جواب دینڑا دی ریکاڈنت کرو

source: Record your voice
hno: اپنڑی آواز ریکارڈ کرو

source: Reference the source of your sentence (required)
hno: جملے دے ماخذ دا حوالہ دیو(ضروی ہے)

source: Refresh
hno: تازہ کرو

source: Reject
hno: مسترد کرو

source: Remove
hno: ہٹاؤ

source: Remove Avatar
hno: Avatar ہٹاؤ

source: Report
hno: رپورٹ کرو

source: Report was passed successfully
hno: رپورٹ کامیابی نال منظور ہوئی

source: Request a Language
hno: ہک زبان دی درخواست کرو

source: Request for Scripted Speech
hno: لکھی دی تقریر آسطے درخواست

source: Request for Spontaneous Speech
hno: بے ساختہ تقریر آسطے درخواست

source: Request New Language
hno: نوّی زبان دی درخواست کرو

source: Request recordings
hno: ریکاڈنگاں دی درخواست دیو

source: *required
hno: چئی دا

source: Re-record
hno: دوبارہ ریکاڈ کرو

source: Re-record clip
hno: کلپ دوبارہ ریکارڈ کرو

source: Respond
hno: جواب دیو

source: Respond To Prompt
hno: پرامپٹ دا جواب دو

source: Respond to prompts to create datasets for organic, colloquial contexts. Perfect for oral-first languages.
hno: اصلی تے عام بات چیت آلے سیاق و سباق آسطے ڈیٹاسیٹ بنڑانڑ آسطے پرامپٹ دا جواب دیو۔ پہلے بولنا آلیاں زباناں آسطے بہترین اے۔

source: Response deleted successfully
hno: جواب کامیابی نال مِٹّایا

source: Response submitted successfully
hno: جواب کامیابی نال جمع ہویّا

source: Return
hno: واپس مڑو

source: Return here to edit your goal anytime.
hno: کسی بھی ویلے اپنڑے مقصد بچ ترمیم کرنا واسطے اتھا واپس آؤ۔

source: Return to Common Voice
hno: کامن وائس تے واپس آؤ

source: Return to Common Voice Datasets
hno: کامن وائس ڈیٹا سیٹ تےواپس مڑو

source: Return to Languages
hno: زباناں تے واپس آؤ

source: Review
hno: نظرثانی کرو

source: Review could not be saved. Please try again later.
hno: جائزہ محفوظ نہ ہویا ہوسی۔ برائے مہربانی بعد بچ دوبارہ کوشش کرو۔

source: ⓘ Review Criteria
hno: ⓘ نظرثانی دا معیار

source: Review Criteria
hno: نظرثانی دا معیار

source: Reviewed sentences not submitted, are sure?
hno: جائزہ گدے دے جملے نیں جمع ہوئے، یقین ہے؟

source: Review existing sentences submitted by the community
hno: کمیونٹی دے جمع کرالے دے موجود جملیاں دا جائزہ گھنو

source: Reviewing Sentences
hno: جملیاں دا جائزہ لینڑا

source: Review & re-record clips here as you go
hno: اِتھا چلدیاں کلپاں دی نظرثانی کرو ہور دوبارہ ریکاڈ کرو

source: Review & re-record clips if needed
hno: ضرورت پڑے تے کلپاں دا جائزہ گنو ہور دوبارہ ریکاڈ کرو

source: Review Sentences
hno: جملیاں دا جائزہ لاؤ

source: Review sentences in your language
hno: اپنڑی زبان بچ جملیاں دا جائزہ گھنو

source: Review & Submit
hno: نظرثانی کرو ہور جمع کرالو

source: Review transcriptions
hno: ٹرانسکرپشناں دا جائزہ گھنو

source: Review transcriptions of recorded sentences for accuracy
hno: ریکارڈ کیتے دے جملیاں دی درستگی واسطے ٹرانسکرپشن دا جائزہ گھنو

source: Review Transcriptions <small>(Coming soon)</small>
hno: ٹرانسکرپشنز دا جائزہ گِھنو<small>(جلدی آ ری اے)</small>

source: Review user-submitted transcriptions in your language
hno: اپنڑی زبان بچ استعمال آلیاں دی جمع کیتی ٹرانسکرپشن دی تصدیق کرو

source: Romanian
hno: رومانی

source: Romansh Sursilvan
hno: رومانش سورسلوان

source: Romansh Vallader
hno: رومانش ویلڈر

source: Rukai
hno: روکاٸی

source: Runyankole
hno: رنیانکول

source: Russian
hno: رُوسی
